/*
  1. Написать метод, которому в качестве аргумента передается не пустой одномерный целочисленный массив.
     Метод должен вернуть новый массив, который получен путем вытаскивания из исходного массива элементов,
     идущих после последней четверки.
     Входной массив должен содержать хотя бы одну четверку, иначе в методе необходимо выбросить RuntimeException.

  2. Написать метод, который проверяет состав массива из чисел 1 и 4.
     Если в нем нет хоть одной четверки или единицы, то метод вернет false;
     Если есть чтото кроме 1 или 4 то вернет false;
*/
class Main {
	public static void main(String[] args) {}
}